{
  "event_name": {
    "type": "string",
    "value": "view_promotion",
    "description": ""
  },
  "version": {
    "type": "number",
    "value": 1,
    "description": ""
  },
  "creative_name": {
    "type": "string",
    "description": "The name of the promotional creative. Ignored if set at the item-level."
  },
  "creative_slot": {
    "type": "string",
    "description": "The name of the promotional creative slot associated with the event. Ignored if set at the item-level."
  },
  "promotion_id": {
    "type": "string",
    "description": "The ID of the promotion associated with the event. Ignored if set at the item-level."
  },
  "promotion_name": {
    "type": "string",
    "description": "The name of the promotion associated with the event. Ignored if set at the item-level."
  },
  "items": {
    "type": "array",
    "description": "The items for the event. * The items array is expected to have a single element, representing the item associated with the promotion. If multiple elements are provided, only the first element in items will be used.",
    "value": null,
    "nestedSchema": {
      "item_id": {
        "type": "string",
        "description": "The ID of the item. *One of item_id or item_name is required."
      },
      "item_name": {
        "type": "string",
        "description": "The name of the item. *One of item_id or item_name is required."
      },
      "affiliation": {
        "type": "string",
        "description": "A product affiliation to designate a supplying company or brick and mortar store location. Note: `affiliation` is only available at the item-scope."
      },
      "coupon": {
        "type": "string",
        "description": "The coupon name/code associated with the item. Event-level and item-level coupon parameters are independent."
      },
      "creative_name": {
        "type": "string",
        "description": "The name of the promotional creative. If set, event-level creative_name is ignored. If not set, event-level creative_name is used, if present."
      },
      "creative_slot": {
        "type": "string",
        "description": "The name of the promotional creative slot associated with the item. If set, event-level creative_slot is ignored. If not set, event-level creative_slot is used, if present."
      },
      "discount": {
        "type": "number",
        "description": "The unit monetary discount value associated with the item."
      },
      "index": {
        "type": "number",
        "description": "The index/position of the item in a list."
      },
      "item_brand": {
        "type": "string",
        "description": "The brand of the item."
      },
      "item_category": {
        "type": "string",
        "description": "The category of the item. If used as part of a category hierarchy or taxonomy then this will be the first category."
      },
      "item_category2": {
        "type": "string",
        "description": "The second category hierarchy or additional taxonomy for the item."
      },
      "item_category3": {
        "type": "string",
        "description": "The third category hierarchy or additional taxonomy for the item."
      },
      "item_category4": {
        "type": "string",
        "description": "The fourth category hierarchy or additional taxonomy for the item."
      },
      "item_category5": {
        "type": "string",
        "description": "The fifth category hierarchy or additional taxonomy for the item."
      },
      "item_list_id": {
        "type": "string",
        "description": "The ID of the list in which the item was presented to the user. If set, event-level item_list_id is ignored. If not set, event-level item_list_id is used, if present."
      },
      "item_list_name": {
        "type": "string",
        "description": "The name of the list in which the item was presented to the user. If set, event-level item_list_name is ignored. If not set, event-level item_list_name is used, if present."
      },
      "item_variant": {
        "type": "string",
        "description": "The item variant or unique code or description for additional item details/options."
      },
      "location_id": {
        "type": "string",
        "description": "The physical location associated with the item (e.g. the physical store location). It's recommended to use the Google Place ID that corresponds to the associated item. A custom location ID can also be used. Note: `location id` is only available at the item-scope."
      },
      "price": {
        "type": "number",
        "description": "The monetary unit price of the item, in units of the specified currency parameter. If a discount applies to the item, set price to the discounted unit price and specify the unit price discount in the discount parameter."
      },
      "promotion_id": {
        "type": "string",
        "description": "The ID of the promotion associated with the item. If set, event-level promotion_id is ignored. If not set, event-level promotion_id is used, if present."
      },
      "promotion_name": {
        "type": "string",
        "description": "The name of the promotion associated with the item. If set, event-level promotion_name is ignored. If not set, event-level promotion_name is used, if present."
      },
      "quantity": {
        "type": "number",
        "description": "Item quantity. If not set, quantity is set to 1."
      }
    }
  }
}